---
kind: property
id: P:Autodesk.Revit.DB.IFC.IFCData.HasValue
source: html/71e834d1-94f3-ff71-f6e5-91d24d89dcf3.htm
---
# Autodesk.Revit.DB.IFC.IFCData.HasValue Property

Identifies if the data is empty or contains a value.

## Syntax (C#)
```csharp
public bool HasValue { get; }
```